In [10]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
conn = sqlite3.connect('chinook.db')

In [3]:
cursor = conn.cursor()

In [8]:
# get a list of tables in the database
tables = []
for row in cursor.execute("SELECT name FROM sqlite_master WHERE type='table'"):
    tables.append(row[0])

# print the list of tables
print(tables)

['albums', 'sqlite_sequence', 'artists', 'customers', 'employees', 'genres', 'invoices', 'invoice_items', 'media_types', 'playlists', 'playlist_track', 'tracks', 'sqlite_stat1']

In [14]:
query = "SELECT e.EmployeeId, e.FirstName, e.LastName, sales_by_rep.Total_sales_by_Sales_rep as Overall_Sales FROM (SELECT Sales_rep_ID, sum(Total_sales) as Total_sales_by_Sales_Rep FROM (SELECT CS.CustomerId, CS.Total_sales, C.SupportRepId as Sales_rep_ID FROM Customer_sales as CS INNER JOIN customers as C ON C.CustomerId = CS.CustomerId) GROUP BY Sales_rep_ID) as sales_by_rep INNER JOIN employees as e ON sales_by_rep.Sales_rep_ID = e.EmployeeId ORDER BY Total_sales_by_Sales_Rep DESC"

In [20]:
data = pd.DataFrame(cursor.execute(query))
data['Employee ID'] = data[0]
data['First Name'] = data[1]
data['Last Name'] = data[2]
data['Total Sales'] = data[3]
data = data[['Employee ID', 'First Name', 'Last Name', 'Total Sales']]
data

   Employee ID First Name Last Name  Total Sales
0            3       Jane   Peacock       833.04
1            4   Margaret      Park       775.40
2            5      Steve   Johnson       720.16

In [21]:
if you dont wan to be dowloading all this packages,  you can use google colab instead of this jupyter notebook

SyntaxError: invalid syntax (<ipython-input-21-01bdc7fce960>, line 1)